[
  {
    "id": "defendr-001",
    "title": "Defendr.gg",
    "description": "Gaming security platform where I led technical strategy as Tech Lead/CTO. Architected scalable microservices infrastructure, managed 8+ engineer team, and established development best practices.",
    "longDescription": "As Tech Lead/CTO at Defendr.gg, I owned the technical vision for a gaming security platform. Responsibilities included: designing microservices architecture to handle high-load gaming traffic, implementing CI/CD pipelines that reduced deployment time by 40%, leading code review processes, and mentoring a team of 8+ engineers. The platform handles thousands of concurrent users with optimized performance and security protocols.",
    "keyMetrics": [
      "40% reduction in deployment time",
      "Scaled to handle 10k+ concurrent users",
      "8+ engineers managed",
      "Zero-downtime deployments achieved"
    ],
    "technologies": [
      "NestJS",
      "TypeScript",
      "Node.js",
      "React",
      "Docker",
      "CI/CD",
      "MongoDB",
      "GraphQL"
    ],
    "roleAndImpact": "Tech Lead/CTO - Full architecture design, team management, DevOps strategy",
    "link": "",
    "featured": true,
    "status": "active"
  },
  {
    "id": "beefood-002",
    "title": "BeeFood - Food Delivery Platform",
    "description": "Full-stack food delivery platform built solo from conception to production. Includes NestJS API, React web app, Flutter mobile app, and AI-based food recommendations using TensorFlow.",
    "longDescription": "BeeFood is a comprehensive food delivery ecosystem I solo-developed. The backend (NestJS + GraphQL) handles 10k+ daily transactions with real-time order tracking. Frontend features responsive React UI with real-time updates. Mobile app built with Flutter provides native iOS/Android experience. Integrated AI recommendation engine using TensorFlow for personalized food suggestions. Full Docker containerization and deployment pipeline.",
    "keyMetrics": [
      "10k+ daily API transactions",
      "Real-time order tracking",
      "Multi-platform deployment (Web, iOS, Android)",
      "AI recommendation engine integrated"
    ],
    "technologies": [
      "NestJS",
      "React",
      "Flutter",
      "GraphQL",
      "MongoDB",
      "Docker",
      "Python",
      "TensorFlow",
      "TypeScript"
    ],
    "roleAndImpact": "Solo Architect & Developer - Entire platform design, backend, frontend, mobile",
    "link": "",
    "featured": true,
    "status": "completed"
  },
  {
    "id": "foodai-003",
    "title": "Food Suggestion AI System",
    "description": "Machine learning model for personalized food recommendations. Designed and trained TensorFlow models with Python to provide intelligent suggestions based on user preferences.",
    "longDescription": "Developed an AI-powered recommendation engine integrated into BeeFood platform. The system uses TensorFlow to analyze user behavior, food preferences, and dietary patterns to deliver personalized food suggestions. Model training pipeline built with Python for continuous improvement. Achieved 85%+ accuracy in recommendation predictions.",
    "keyMetrics": [
      "85%+ recommendation accuracy",
      "Processes 10k+ user interactions daily",
      "Continuous model training pipeline",
      "Response time <100ms"
    ],
    "technologies": [
      "Python",
      "TensorFlow",
      "Machine Learning",
      "Data Processing",
      "NumPy",
      "Pandas"
    ],
    "roleAndImpact": "ML Engineer - Model design, training, and deployment",
    "link": "",
    "featured": true,
    "status": "completed"
  },
  {
    "id": "picclic-004",
    "title": "PicClic - Web Scraping & Image Tool",
    "description": "Web scraping platform with image extraction and manipulation capabilities. Built with Express backend, React frontend, and MongoDB database using GraphQL API.",
    "longDescription": "PicClic is a web scraping tool for image discovery and manipulation. Features include: automated web scraping to extract images from target websites, advanced image processing and filtering, user-friendly React interface, and GraphQL API for flexible querying. Implemented with MongoDB for efficient image metadata storage, TailwindCSS for modern UI, and Express backend.",
    "keyMetrics": [
      "Processes 1k+ images daily",
      "GraphQL API with flexible querying",
      "Real-time image processing",
      "Scalable MongoDB storage"
    ],
    "technologies": [
      "Express.js",
      "React",
      "MongoDB",
      "GraphQL",
      "TailwindCSS",
      "Node.js"
    ],
    "roleAndImpact": "Full-Stack Developer - Cross-functional team collaboration",
    "link": "",
    "featured": false,
    "status": "completed"
  },
  {
    "id": "upkrus-005",
    "title": "Upkrus E-Learning Platform Enhancement",
    "description": "Refactored and enhanced e-learning platform architecture. Improved code quality by 35%, optimized API performance, and unified frontend stack across React and Angular.",
    "longDescription": "Collaborated on Upkrus, a comprehensive e-learning platform. Key contributions: refactored monolithic codebase to microservices architecture improving maintainability, optimized database queries reducing load times by 15%, unified frontend components across React and Angular, improved API response times through caching strategies, and established code quality standards through rigorous code reviews.",
    "keyMetrics": [
      "35% improvement in code quality metrics",
      "15% reduction in API response times",
      "Unified component library",
      "100+ modules refactored"
    ],
    "technologies": [
      "NestJS",
      "Express.js",
      "React",
      "Angular",
      "GraphQL",
      "MongoDB",
      "Node.js"
    ],
    "roleAndImpact": "Backend & Frontend Developer - Architecture improvement, code quality",
    "link": "",
    "featured": false,
    "status": "completed"
  },
  {
    "id": "guide-alize-006",
    "title": "Guide Alize - Medical Assistant Platform",
    "description": "Healthcare platform for medical professionals featuring real-time data and optimized performance. Enhanced UI/UX, improved load times by 5%, and implemented secure authentication.",
    "longDescription": "Guide Alize is a medical assistance platform used by healthcare professionals. Responsibilities included: updating and improving UI/UX design, optimizing platform performance (5% load time improvement), implementing enterprise-grade authentication and security protocols, enhancing React Native mobile app, and ensuring HIPAA compliance for sensitive medical data.",
    "keyMetrics": [
      "5% load time improvement",
      "HIPAA compliant",
      "50%+ faster authentication",
      "99.9% uptime achieved"
    ],
    "technologies": [
      "Express.js",
      "React",
      "React Native",
      "MongoDB",
      "GraphQL",
      "TailwindCSS"
    ],
    "roleAndImpact": "Full-Stack Developer - Performance optimization, security implementation",
    "link": "",
    "featured": false,
    "status": "completed"
  }
]
